autopkgtest: DBG: testbed init
autopkgtest [16:09:49]: starting date and time: 2023-02-14 16:09:49+0800
autopkgtest [16:09:49]: version 5.28
autopkgtest [16:09:49]: host debian; command line: /usr/bin/autopkgtest /home/minami/Documents/openkylin-riscv/src/dwarves_1.22-ok1.dsc -o /home/minami/Documents/openkylin-riscv/test/dwarves -d -B -- qemu -u root -p openkylin --qemu-architecture=riscv64 -c 8 --ram-size=8192 -d '--qemu-options=-machine virt -kernel /home/minami/Documents/ukylin/u-boot.bin' /home/minami/Documents/openkylin-riscv/testing.qcow2
autopkgtest: DBG: got reply from testbed: ok
autopkgtest: DBG: testbed open, scratch=None
autopkgtest: DBG: sending command to testbed: open
autopkgtest-virt-qemu: DBG: executing open
autopkgtest-virt-qemu: DBG: find_free_port: trying 10022
autopkgtest-virt-qemu: DBG: find_free_port: 10022 is free
autopkgtest-virt-qemu: DBG: autopkgtest does not know how to boot this machine, hopefully nothing special needs to be done?
autopkgtest-virt-qemu: DBG: qemu architecture: riscv64
autopkgtest-virt-qemu: DBG: qemu command: qemu-system-riscv64
autopkgtest-virt-qemu: DBG: execute-timeout: qemu-img info --output=json /home/minami/Documents/openkylin-riscv/testing.qcow2
autopkgtest-virt-qemu: DBG: Creating temporary overlay image in /tmp/autopkgtest-qemu.fo163c2j/overlay.img

Setting up autopkgtest-satdep (0) ...
autopkgtest: DBG: testbed command exited with code 0
autopkgtest: DBG: testbed command ['dpkg-query', '--show', '-f', '${Status}', 'pahole'], kind short, sout pipe, serr pipe, env []
autopkgtest: DBG: testbed command exited with code 0
autopkgtest: DBG: testbed command ['dpkg-query', '--show', '-f', '${Status}', 'dwarves'], kind short, sout pipe, serr pipe, env []
autopkgtest: DBG: testbed command exited with code 0
autopkgtest: DBG: testbed command ['dpkg', '--status', 'autopkgtest-satdep'], kind short, sout pipe, serr pipe, env []
autopkgtest: DBG: testbed command exited with code 0
autopkgtest: DBG: testbed command ['apt-get', '--simulate', '--quiet', '-o', 'APT::Get::Show-User-Simulation-Note=False', '--auto-remove', 'purge', 'autopkgtest-satdep'], kind short, sout pipe, serr pipe, env []
autopkgtest: DBG: testbed command exited with code 0
autopkgtest: DBG: testbed command ['dpkg', '--purge', 'autopkgtest-satdep'], kind short, sout raw, serr raw, env []
(Reading database ... 161324 files and directories currently installed.)
Removing autopkgtest-satdep (0) ...
autopkgtest: DBG: testbed command exited with code 0
autopkgtest: DBG: testbed command ['sh', '-ec', 'command -v dpkg-query'], kind short, sout pipe, serr pipe, env []
autopkgtest: DBG: testbed command exited with code 0
autopkgtest: DBG: testbed command ['sh', '-ec', "dpkg-query --show -f '${Package}\\t${Version}\\n' > /tmp/autopkgtest.6XpqOe/dwarf-struct-with-hole-packages.all"], kind short, sout raw, serr pipe, env []
autopkgtest: DBG: testbed command exited with code 0
autopkgtest: DBG: sending command to testbed: copyup /tmp/autopkgtest.6XpqOe/dwarf-struct-with-hole-packages.all /home/minami/Documents/openkylin-riscv/test/dwarves/dwarf-struct-with-hole-packages.all
autopkgtest-virt-qemu: DBG: executing copyup /tmp/autopkgtest.6XpqOe/dwarf-struct-with-hole-packages.all /home/minami/Documents/openkylin-riscv/test/dwarves/dwarf-struct-with-hole-packages.all
autopkgtest-virt-qemu: DBG: ['cmdls', "(['/tmp/autopkgtest-qemu.fo163c2j/runcmd', 'sh', '-ec', 'cat </tmp/autopkgtest.6XpqOe/dwarf-struct-with-hole-packages.all'], ['cat'])"]
autopkgtest-virt-qemu: DBG: ['srcstdin', "<_io.BufferedReader name='/dev/null'>", 'deststdout', "<_io.BufferedWriter name='/home/minami/Documents/openkylin-riscv/test/dwarves/dwarf-struct-with-hole-packages.all'>", 'devnull_read', <_io.BufferedReader name='/dev/null'>]
autopkgtest-virt-qemu: DBG:  +< /tmp/autopkgtest-qemu.fo163c2j/runcmd sh -ec cat </tmp/autopkgtest.6XpqOe/dwarf-struct-with-hole-packages.all
autopkgtest-virt-qemu: DBG:  +> cat
autopkgtest-virt-qemu: DBG:  +>?
autopkgtest-virt-qemu: DBG:  +<?
autopkgtest: DBG: got reply from testbed: ok
autopkgtest: DBG: testbed command ['test', '-e', '/tmp/autopkgtest.6XpqOe/build.a0O/src'], kind short, sout raw, serr raw, env []
autopkgtest: DBG: testbed command exited with code 0
autopkgtest: DBG: copydown: tb path /tmp/autopkgtest.6XpqOe/build.a0O/src already exists
autopkgtest [16:12:34]: test dwarf-struct-with-hole: [-----------------------
autopkgtest: DBG: testbed command ['su', '-s', '/bin/bash', 'openkylin', '-c', 'set -e; export USER=`id -nu`; . /etc/profile >/dev/null 2>&1 || true;  . ~/.profile >/dev/null 2>&1 || true; buildtree="/tmp/autopkgtest.6XpqOe/build.a0O/src"; mkdir -p -m 1777 -- "/tmp/autopkgtest.6XpqOe/dwarf-struct-with-hole-artifacts"; export AUTOPKGTEST_ARTIFACTS="/tmp/autopkgtest.6XpqOe/dwarf-struct-with-hole-artifacts"; export ADT_ARTIFACTS="$AUTOPKGTEST_ARTIFACTS"; mkdir -p -m 755 "/tmp/autopkgtest.6XpqOe/autopkgtest_tmp"; export AUTOPKGTEST_TMP="/tmp/autopkgtest.6XpqOe/autopkgtest_tmp"; export ADTTMP="$AUTOPKGTEST_TMP"; export DEBIAN_FRONTEND=noninteractive; export LANG=C.UTF-8; export DEB_BUILD_OPTIONS=parallel=8; unset LANGUAGE LC_CTYPE LC_NUMERIC LC_TIME LC_COLLATE   LC_MONETARY LC_MESSAGES LC_PAPER LC_NAME LC_ADDRESS   LC_TELEPHONE LC_MEASUREMENT LC_IDENTIFICATION LC_ALL;cd "$buildtree"; chmod +x /tmp/autopkgtest.6XpqOe/build.a0O/src/debian/tests/dwarf-struct-with-hole; exec /tmp/autopkgtest.6XpqOe/wrapper.sh --script-pid-file=/tmp/autopkgtest_script_pid --stderr=/tmp/autopkgtest.6XpqOe/dwarf-struct-with-hole-stderr --stdout=/tmp/autopkgtest.6XpqOe/dwarf-struct-with-hole-stdout -- /tmp/autopkgtest.6XpqOe/build.a0O/src/debian/tests/dwarf-struct-with-hole ;'], kind test, sout raw, serr raw, env []
pahole.c: In function prototype__stdio_fprintf_value:
pahole.c:2245:7: warning: implicit declaration of function asprintf; did you mean vsprintf? [-Wimplicit-function-declaration]
 2245 |   if (asprintf(&member_name, "%s.%s", range, "offset") == -1) {
      |       ^~~~~~~~
      |       vsprintf
pahole.o: ELF 64-bit LSB relocatable, UCB RISC-V, version 1 (SYSV), with debug_info, not stripped
The 5 biggest data structures:
cu	312	2
function	240	1
_IO_FILE	216	2
class	208	1
type	168	0
btf_encoder__new: 'pahole.o' doesn't have '.data..percpu' section
Found 0 per-CPU variables!
Found 114 functions!
File pahole.o:
[1] TYPEDEF size_t type_id=3
[2] CONST (anon) type_id=1
[3] INT long unsigned int size=8 nr_bits=64 encoding=(none)
[4] INT unsigned char size=1 nr_bits=8 encoding=(none)
[5] INT short unsigned int size=2 nr_bits=16 encoding=(none)
[6] INT unsigned int size=4 nr_bits=32 encoding=(none)
[7] TYPEDEF __int8_t type_id=8
[8] INT signed char size=1 nr_bits=8 encoding=(none)
[9] TYPEDEF __uint8_t type_id=4
[10] INT short int size=2 nr_bits=16 encoding=SIGNED
[11] TYPEDEF __uint16_t type_id=5
[12] TYPEDEF __int32_t type_id=13
[13] INT int size=4 nr_bits=32 encoding=SIGNED
[14] TYPEDEF __uint32_t type_id=6
[15] TYPEDEF __int64_t type_id=16
[16] INT long int size=8 nr_bits=64 encoding=SIGNED
[17] TYPEDEF __uint64_t type_id=3
[18] TYPEDEF __off_t type_id=16
[19] TYPEDEF __off64_t type_id=16
[20] PTR (anon) type_id=0
[21] PTR (anon) type_id=22
[22] INT char size=1 nr_bits=8 encoding=(none)
[23] CONST (anon) type_id=22
[24] ARRAY (anon) type_id=22 index_type_id=13 nr_elems=4
[25] STRUCT _IO_FILE size=216
	_flags type_id=13 bits_offset=0
	_IO_read_ptr type_id=21 bits_offset=64
	_IO_read_end type_id=21 bits_offset=128
	_IO_read_base type_id=21 bits_offset=192
	_IO_write_base type_id=21 bits_offset=256
	_IO_write_ptr type_id=21 bits_offset=320
	_IO_write_end type_id=21 bits_offset=384
	_IO_buf_base type_id=21 bits_offset=448
	_IO_buf_end type_id=21 bits_offset=512
	_IO_save_base type_id=21 bits_offset=576
	_IO_backup_base type_id=21 bits_offset=640
	_IO_save_end type_id=21 bits_offset=704
	_markers type_id=29 bits_offset=768
	_chain type_id=30 bits_offset=832
	_fileno type_id=13 bits_offset=896
	_flags2 type_id=13 bits_offset=928
	_old_offset type_id=18 bits_offset=960
	_cur_column type_id=5 bits_offset=1024
	_vtable_offset type_id=8 bits_offset=1040
	_shortbuf type_id=31 bits_offset=1048
	_lock type_id=32 bits_offset=1088
	_offset type_id=19 bits_offset=1152
	_codecvt type_id=34 bits_offset=1216
	_wide_data type_id=36 bits_offset=1280
	_freeres_list type_id=30 bits_offset=1344
	_freeres_buf type_id=20 bits_offset=1408
	__pad5 type_id=1 bits_offset=1472
	_mode type_id=13 bits_offset=1536
	_unused2 type_id=37 bits_offset=1568
[26] TYPEDEF FILE type_id=25
[27] TYPEDEF _IO_lock_t type_id=0
[28] FWD _IO_marker struct
[29] PTR (anon) type_id=28
[30] PTR (anon) type_id=25
[31] ARRAY (anon) type_id=22 index_type_id=13 nr_elems=1
[32] PTR (anon) type_id=27
[33] FWD _IO_codecvt struct
[34] PTR (anon) type_id=33
[35] FWD _IO_wide_data struct
[36] PTR (anon) type_id=35
[37] ARRAY (anon) type_id=22 index_type_id=13 nr_elems=20
[38] TYPEDEF off_t type_id=18
[39] PTR (anon) type_id=26
[40] RESTRICT (anon) type_id=39
[41] ENUM (anon) size=4
	_ISupper val=256
	_ISlower val=512
	_ISalpha val=1024
	_ISdigit val=2048
	_ISxdigit val=4096
	_ISspace val=8192
	_ISprint val=16384
	_ISgraph val=32768
	_ISblank val=1
	_IScntrl val=2
	_ISpunct val=4
	_ISalnum val=8
[42] PTR (anon) type_id=23
[43] TYPEDEF error_t type_id=13
[44] STRUCT argp_option size=48
	name type_id=42 bits_offset=0
	key type_id=13 bits_offset=64
	arg type_id=42 bits_offset=128
	flags type_id=13 bits_offset=192
	doc type_id=42 bits_offset=256
	group type_id=13 bits_offset=320
[45] CONST (anon) type_id=44
[46] TYPEDEF argp_parser_t type_id=47
[47] PTR (anon) type_id=48
[48] FUNC_PROTO (anon) return=43 args=(13 (null), 21 (null), 49 (null))
[49] PTR (anon) type_id=51
[50] RESTRICT (anon) type_id=49
[51] STRUCT argp_state size=96
	root_argp type_id=60 bits_offset=0
	argc type_id=13 bits_offset=64
	argv type_id=61 bits_offset=128
	next type_id=13 bits_offset=192
	flags type_id=6 bits_offset=224
	arg_num type_id=6 bits_offset=256
	quoted type_id=13 bits_offset=288
	input type_id=20 bits_offset=320
	child_inputs type_id=62 bits_offset=384
	hook type_id=20 bits_offset=448
	name type_id=21 bits_offset=512
	err_stream type_id=39 bits_offset=576
	out_stream type_id=39 bits_offset=640
	pstate type_id=20 bits_offset=704
[52] STRUCT argp size=56
	options type_id=54 bits_offset=0
	parser type_id=46 bits_offset=64
	args_doc type_id=42 bits_offset=128
	doc type_id=42 bits_offset=192
	children type_id=57 bits_offset=256
	help_filter type_id=59 bits_offset=320
	argp_domain type_id=42 bits_offset=384
[53] CONST (anon) type_id=52
[54] PTR (anon) type_id=45
[55] STRUCT argp_child size=32
	argp type_id=60 bits_offset=0
	flags type_id=13 bits_offset=64
	header type_id=42 bits_offset=128
	group type_id=13 bits_offset=192
[56] CONST (anon) type_id=55
[57] PTR (anon) type_id=56
[58] FUNC_PROTO (anon) return=21 args=(13 (null), 42 (null), 20 (null))
[59] PTR (anon) type_id=58
[60] PTR (anon) type_id=53
[61] PTR (anon) type_id=21
[62] PTR (anon) type_id=20
[63] FUNC_PROTO (anon) return=0 args=(40 (null), 50 (null))
[64] PTR (anon) type_id=63
[65] ENUM (anon) size=4
	DW_TAG_array_type val=1
	DW_TAG_class_type val=2
	DW_TAG_entry_point val=3
	DW_TAG_enumeration_type val=4
	DW_TAG_formal_parameter val=5
	DW_TAG_imported_declaration val=8
	DW_TAG_label val=10
	DW_TAG_lexical_block val=11
	DW_TAG_member val=13
	DW_TAG_pointer_type val=15
	DW_TAG_reference_type val=16
	DW_TAG_compile_unit val=17
	DW_TAG_string_type val=18
	DW_TAG_structure_type val=19
	DW_TAG_subroutine_type val=21
	DW_TAG_typedef val=22
	DW_TAG_union_type val=23
	DW_TAG_unspecified_parameters val=24
	DW_TAG_variant val=25
	DW_TAG_common_block val=26
	DW_TAG_common_inclusion val=27
	DW_TAG_inheritance val=28
	DW_TAG_inlined_subroutine val=29
	DW_TAG_module val=30
	DW_TAG_ptr_to_member_type val=31
	DW_TAG_set_type val=32
	DW_TAG_subrange_type val=33
	DW_TAG_with_stmt val=34
	DW_TAG_access_declaration val=35
	DW_TAG_base_type val=36
	DW_TAG_catch_block val=37
	DW_TAG_const_type val=38
	DW_TAG_constant val=39
	DW_TAG_enumerator val=40
	DW_TAG_file_type val=41
	DW_TAG_friend val=42
	DW_TAG_namelist val=43
	DW_TAG_namelist_item val=44
	DW_TAG_packed_type val=45
	DW_TAG_subprogram val=46
	DW_TAG_template_type_parameter val=47
	DW_TAG_template_value_parameter val=48
	DW_TAG_thrown_type val=49
	DW_TAG_try_block val=50
	DW_TAG_variant_part val=51
	DW_TAG_variable val=52
	DW_TAG_volatile_type val=53
	DW_TAG_dwarf_procedure val=54
	DW_TAG_restrict_type val=55
	DW_TAG_interface_type val=56
	DW_TAG_namespace val=57
	DW_TAG_imported_module val=58
	DW_TAG_unspecified_type val=59
	DW_TAG_partial_unit val=60
	DW_TAG_imported_unit val=61
	DW_TAG_condition val=63
	DW_TAG_shared_type val=64
	DW_TAG_type_unit val=65
	DW_TAG_rvalue_reference_type val=66
	DW_TAG_template_alias val=67
	DW_TAG_coarray_type val=68
	DW_TAG_generic_subrange val=69
	DW_TAG_dynamic_type val=70
	DW_TAG_atomic_type val=71
	DW_TAG_call_site val=72
	DW_TAG_call_site_parameter val=73
	DW_TAG_skeleton_unit val=74
	DW_TAG_immutable_type val=75
	DW_TAG_lo_user val=16512
	DW_TAG_MIPS_loop val=16513
	DW_TAG_format_label val=16641
	DW_TAG_function_template val=16642
	DW_TAG_class_template val=16643
	DW_TAG_GNU_BINCL val=16644
	DW_TAG_GNU_EINCL val=16645
	DW_TAG_GNU_template_template_param val=16646
	DW_TAG_GNU_template_parameter_pack val=16647
	DW_TAG_GNU_formal_parameter_pack val=16648
	DW_TAG_GNU_call_site val=16649
	DW_TAG_GNU_call_site_parameter val=16650
	DW_TAG_hi_user val=65535
[66] TYPEDEF int8_t type_id=7
[67] TYPEDEF int32_t type_id=12
[68] TYPEDEF int64_t type_id=15
[69] TYPEDEF uint8_t type_id=9
[70] CONST (anon) type_id=69
[71] TYPEDEF uint16_t type_id=11
[72] TYPEDEF uint32_t type_id=14
[73] CONST (anon) type_id=72
[74] TYPEDEF uint64_t type_id=17
[75] ARRAY (anon) type_id=21 index_type_id=13 nr_elems=2
[76] INT long long unsigned int size=8 nr_bits=64 encoding=(none)
[77] STRUCT __pthread_internal_list size=16
	__prev type_id=78 bits_offset=0
	__next type_id=78 bits_offset=64
[78] PTR (anon) type_id=77
[79] TYPEDEF __pthread_list_t type_id=77
[80] STRUCT __pthread_mutex_s size=40
	__lock type_id=13 bits_offset=0
	__count type_id=6 bits_offset=32
	__owner type_id=13 bits_offset=64
	__nusers type_id=6 bits_offset=96
	__kind type_id=13 bits_offset=128
	__spins type_id=13 bits_offset=160
	__list type_id=79 bits_offset=192
[81] UNION (anon) size=40
	__data type_id=80 bits_offset=0
	__size type_id=82 bits_offset=0
	__align type_id=16 bits_offset=0
[82] ARRAY (anon) type_id=22 index_type_id=13 nr_elems=40
[83] TYPEDEF pthread_mutex_t type_id=81
[84] INT long long int size=8 nr_bits=64 encoding=SIGNED
[85] INT double size=8 nr_bits=64 encoding=(none)
[86] ENUM (anon) size=4
	PTHREAD_MUTEX_TIMED_NP val=0
	PTHREAD_MUTEX_RECURSIVE_NP val=1
	PTHREAD_MUTEX_ERRORCHECK_NP val=2
	PTHREAD_MUTEX_ADAPTIVE_NP val=3
	PTHREAD_MUTEX_NORMAL val=0
	PTHREAD_MUTEX_RECURSIVE val=1
	PTHREAD_MUTEX_ERRORCHECK val=2
	PTHREAD_MUTEX_DEFAULT val=0
[87] ENUM (anon) size=4
	_SC_ARG_MAX val=0
	_SC_CHILD_MAX val=1
	_SC_CLK_TCK val=2
	_SC_NGROUPS_MAX val=3
	_SC_OPEN_MAX val=4
	_SC_STREAM_MAX val=5
	_SC_TZNAME_MAX val=6
	_SC_JOB_CONTROL val=7
	_SC_SAVED_IDS val=8
	_SC_REALTIME_SIGNALS val=9
	_SC_PRIORITY_SCHEDULING val=10
	_SC_TIMERS val=11
	_SC_ASYNCHRONOUS_IO val=12
	_SC_PRIORITIZED_IO val=13
	_SC_SYNCHRONIZED_IO val=14
	_SC_FSYNC val=15
	_SC_MAPPED_FILES val=16
	_SC_MEMLOCK val=17
	_SC_MEMLOCK_RANGE val=18
	_SC_MEMORY_PROTECTION val=19
	_SC_MESSAGE_PASSING val=20
	_SC_SEMAPHORES val=21
	_SC_SHARED_MEMORY_OBJECTS val=22
	_SC_AIO_LISTIO_MAX val=23
	_SC_AIO_MAX val=24
	_SC_AIO_PRIO_DELTA_MAX val=25
	_SC_DELAYTIMER_MAX val=26
	_SC_MQ_OPEN_MAX val=27
	_SC_MQ_PRIO_MAX val=28
	_SC_VERSION val=29
	_SC_PAGESIZE val=30
	_SC_RTSIG_MAX val=31
	_SC_SEM_NSEMS_MAX val=32
	_SC_SEM_VALUE_MAX val=33
	_SC_SIGQUEUE_MAX val=34
	_SC_TIMER_MAX val=35
	_SC_BC_BASE_MAX val=36
	_SC_BC_DIM_MAX val=37
	_SC_BC_SCALE_MAX val=38
	_SC_BC_STRING_MAX val=39
	_SC_COLL_WEIGHTS_MAX val=40
	_SC_EQUIV_CLASS_MAX val=41
	_SC_EXPR_NEST_MAX val=42
	_SC_LINE_MAX val=43
	_SC_RE_DUP_MAX val=44
	_SC_CHARCLASS_NAME_MAX val=45
	_SC_2_VERSION val=46
	_SC_2_C_BIND val=47
	_SC_2_C_DEV val=48
	_SC_2_FORT_DEV val=49
	_SC_2_FORT_RUN val=50
	_SC_2_SW_DEV val=51
	_SC_2_LOCALEDEF val=52
	_SC_PII val=53
	_SC_PII_XTI val=54
	_SC_PII_SOCKET val=55
	_SC_PII_INTERNET val=56
	_SC_PII_OSI val=57
	_SC_POLL val=58
	_SC_SELECT val=59
	_SC_UIO_MAXIOV val=60
	_SC_IOV_MAX val=60
	_SC_PII_INTERNET_STREAM val=61
	_SC_PII_INTERNET_DGRAM val=62
	_SC_PII_OSI_COTS val=63
	_SC_PII_OSI_CLTS val=64
	_SC_PII_OSI_M val=65
	_SC_T_IOV_MAX val=66
	_SC_THREADS val=67
	_SC_THREAD_SAFE_FUNCTIONS val=68
	_SC_GETGR_R_SIZE_MAX val=69
	_SC_GETPW_R_SIZE_MAX val=70
	_SC_LOGIN_NAME_MAX val=71
	_SC_TTY_NAME_MAX val=72
	_SC_THREAD_DESTRUCTOR_ITERATIONS val=73
	_SC_THREAD_KEYS_MAX val=74
	_SC_THREAD_STACK_MIN val=75
	_SC_THREAD_THREADS_MAX val=76
	_SC_THREAD_ATTR_STACKADDR val=77
	_SC_THREAD_ATTR_STACKSIZE val=78
	_SC_THREAD_PRIORITY_SCHEDULING val=79
	_SC_THREAD_PRIO_INHERIT val=80
	_SC_THREAD_PRIO_PROTECT val=81
	_SC_THREAD_PROCESS_SHARED val=82
	_SC_NPROCESSORS_CONF val=83
	_SC_NPROCESSORS_ONLN val=84
	_SC_PHYS_PAGES val=85
	_SC_AVPHYS_PAGES val=86
	_SC_ATEXIT_MAX val=87
	_SC_PASS_MAX val=88
	_SC_XOPEN_VERSION val=89
	_SC_XOPEN_XCU_VERSION val=90
	_SC_XOPEN_UNIX val=91
	_SC_XOPEN_CRYPT val=92
	_SC_XOPEN_ENH_I18N val=93
	_SC_XOPEN_SHM val=94
	_SC_2_CHAR_TERM val=95
	_SC_2_C_VERSION val=96
	_SC_2_UPE val=97
	_SC_XOPEN_XPG2 val=98
	_SC_XOPEN_XPG3 val=99
	_SC_XOPEN_XPG4 val=100
	_SC_CHAR_BIT val=101
	_SC_CHAR_MAX val=102
	_SC_CHAR_MIN val=103
	_SC_INT_MAX val=104
	_SC_INT_MIN val=105
	_SC_LONG_BIT val=106
	_SC_WORD_BIT val=107
	_SC_MB_LEN_MAX val=108
	_SC_NZERO val=109
	_SC_SSIZE_MAX val=110
	_SC_SCHAR_MAX val=111
	_SC_SCHAR_MIN val=112
	_SC_SHRT_MAX val=113
	_SC_SHRT_MIN val=114
	_SC_UCHAR_MAX val=115
	_SC_UINT_MAX val=116
	_SC_ULONG_MAX val=117
	_SC_USHRT_MAX val=118
	_SC_NL_ARGMAX val=119
	_SC_NL_LANGMAX val=120
	_SC_NL_MSGMAX val=121
	_SC_NL_NMAX val=122
	_SC_NL_SETMAX val=123
	_SC_NL_TEXTMAX val=124
	_SC_XBS5_ILP32_OFF32 val=125
	_SC_XBS5_ILP32_OFFBIG val=126
	_SC_XBS5_LP64_OFF64 val=127
	_SC_XBS5_LPBIG_OFFBIG val=128
	_SC_XOPEN_LEGACY val=129
	_SC_XOPEN_REALTIME val=130
	_SC_XOPEN_REALTIME_THREADS val=131
	_SC_ADVISORY_INFO val=132
	_SC_BARRIERS val=133
	_SC_BASE val=134
	_SC_C_LANG_SUPPORT val=135
	_SC_C_LANG_SUPPORT_R val=136
	_SC_CLOCK_SELECTION val=137
	_SC_CPUTIME val=138
	_SC_THREAD_CPUTIME val=139
	_SC_DEVICE_IO val=140
	_SC_DEVICE_SPECIFIC val=141
	_SC_DEVICE_SPECIFIC_R val=142
	_SC_FD_MGMT val=143
	_SC_FIFO val=144
	_SC_PIPE val=145
	_SC_FILE_ATTRIBUTES val=146
	_SC_FILE_LOCKING val=147
	_SC_FILE_SYSTEM val=148
	_SC_MONOTONIC_CLOCK val=149
	_SC_MULTI_PROCESS val=150
	_SC_SINGLE_PROCESS val=151
	_SC_NETWORKING val=152
	_SC_READER_WRITER_LOCKS val=153
	_SC_SPIN_LOCKS val=154
	_SC_REGEXP val=155
	_SC_REGEX_VERSION val=156
	_SC_SHELL val=157
	_SC_SIGNALS val=158
	_SC_SPAWN val=159
	_SC_SPORADIC_SERVER val=160
	_SC_THREAD_SPORADIC_SERVER val=161
	_SC_SYSTEM_DATABASE val=162
	_SC_SYSTEM_DATABASE_R val=163
	_SC_TIMEOUTS val=164
	_SC_TYPED_MEMORY_OBJECTS val=165
	_SC_USER_GROUPS val=166
	_SC_USER_GROUPS_R val=167
	_SC_2_PBS val=168
	_SC_2_PBS_ACCOUNTING val=169
	_SC_2_PBS_LOCATE val=170
	_SC_2_PBS_MESSAGE val=171
	_SC_2_PBS_TRACK val=172
	_SC_SYMLOOP_MAX val=173
	_SC_STREAMS val=174
	_SC_2_PBS_CHECKPOINT val=175
	_SC_V6_ILP32_OFF32 val=176
	_SC_V6_ILP32_OFFBIG val=177
	_SC_V6_LP64_OFF64 val=178
	_SC_V6_LPBIG_OFFBIG val=179
	_SC_HOST_NAME_MAX val=180
	_SC_TRACE val=181
	_SC_TRACE_EVENT_FILTER val=182
	_SC_TRACE_INHERIT val=183
	_SC_TRACE_LOG val=184
	_SC_LEVEL1_ICACHE_SIZE val=185
	_SC_LEVEL1_ICACHE_ASSOC val=186
	_SC_LEVEL1_ICACHE_LINESIZE val=187
	_SC_LEVEL1_DCACHE_SIZE val=188
	_SC_LEVEL1_DCACHE_ASSOC val=189
	_SC_LEVEL1_DCACHE_LINESIZE val=190
	_SC_LEVEL2_CACHE_SIZE val=191
	_SC_LEVEL2_CACHE_ASSOC val=192
	_SC_LEVEL2_CACHE_LINESIZE val=193
	_SC_LEVEL3_CACHE_SIZE val=194
	_SC_LEVEL3_CACHE_ASSOC val=195
	_SC_LEVEL3_CACHE_LINESIZE val=196
	_SC_LEVEL4_CACHE_SIZE val=197
	_SC_LEVEL4_CACHE_ASSOC val=198
	_SC_LEVEL4_CACHE_LINESIZE val=199
	_SC_IPV6 val=235
	_SC_RAW_SOCKETS val=236
	_SC_V7_ILP32_OFF32 val=237
	_SC_V7_ILP32_OFFBIG val=238
	_SC_V7_LP64_OFF64 val=239
	_SC_V7_LPBIG_OFFBIG val=240
	_SC_SS_REPL_MAX val=241
	_SC_TRACE_EVENT_NAME_MAX val=242
	_SC_TRACE_NAME_MAX val=243
	_SC_TRACE_SYS_MAX val=244
	_SC_TRACE_USER_EVENT_MAX val=245
	_SC_XOPEN_STREAMS val=246
	_SC_THREAD_ROBUST_PRIO_INHERIT val=247
	_SC_THREAD_ROBUST_PRIO_PROTECT val=248
	_SC_MINSIGSTKSZ val=249
	_SC_SIGSTKSZ val=250
[88] STRUCT _obstack_chunk size=24
	limit type_id=21 bits_offset=0
	prev type_id=89 bits_offset=64
	contents type_id=24 bits_offset=128
[89] PTR (anon) type_id=88
[90] UNION (anon) size=8
	tempint type_id=16 bits_offset=0
	tempptr type_id=20 bits_offset=0
[91] STRUCT obstack size=88
	chunk_size type_id=16 bits_offset=0
	chunk type_id=89 bits_offset=64
	object_base type_id=21 bits_offset=128
	next_free type_id=21 bits_offset=192
	chunk_limit type_id=21 bits_offset=256
	temp type_id=90 bits_offset=320
	alignment_mask type_id=13 bits_offset=384
	chunkfun type_id=93 bits_offset=448
	freefun type_id=95 bits_offset=512
	extra_arg type_id=20 bits_offset=576
	use_extra_arg type_id=6 bitfield_size=1 bits_offset=640
	maybe_empty_object type_id=6 bitfield_size=1 bits_offset=641
	alloc_failed type_id=6 bitfield_size=1 bits_offset=642
[92] FUNC_PROTO (anon) return=89 args=(20 (null), 16 (null))
[93] PTR (anon) type_id=92
[94] FUNC_PROTO (anon) return=0 args=(20 (null), 89 (null))
[95] PTR (anon) type_id=94
[96] FUNC_PROTO (anon) return=0 args=(void)
[97] PTR (anon) type_id=96
[98] TYPEDEF Elf type_id=99
[99] FWD Elf struct
[100] INT long double size=16 nr_bits=128 encoding=(none)
[101] TYPEDEF Dwfl_Module type_id=102
[102] FWD Dwfl_Module struct
[103] PTR (anon) type_id=101
[104] PTR (anon) type_id=98
[105] INT _Bool size=1 nr_bits=8 encoding=BOOL
[106] STRUCT rb_node size=24
	rb_parent_color type_id=3 bits_offset=0
	rb_right type_id=108 bits_offset=64
	rb_left type_id=108 bits_offset=128
[107] CONST (anon) type_id=106
[108] PTR (anon) type_id=106
[109] STRUCT rb_root size=8
	rb_node type_id=108 bits_offset=0
[110] STRUCT list_head size=16
	next type_id=112 bits_offset=0
	prev type_id=112 bits_offset=64
[111] CONST (anon) type_id=110
[112] PTR (anon) type_id=110
[113] STRUCT hlist_node size=16
	next type_id=114 bits_offset=0
	pprev type_id=115 bits_offset=64
[114] PTR (anon) type_id=113
[115] PTR (anon) type_id=114
[116] ENUM load_steal_kind size=4
	LSK__KEEPIT val=0
	LSK__DELETE val=1
	LSK__STOP_LOADING val=2
[117] TYPEDEF type_id_t type_id=72
[118] STRUCT conf_load size=64
	steal type_id=124 bits_offset=0
	cookie type_id=20 bits_offset=64
	format_path type_id=21 bits_offset=128
	nr_jobs type_id=13 bits_offset=192
	extra_dbg_info type_id=105 bits_offset=224
	use_obstack type_id=105 bits_offset=232
	fixup_silly_bitfields type_id=105 bits_offset=240
	get_addr_info type_id=105 bits_offset=248
	ignore_alignment_attr type_id=105 bits_offset=256
	ignore_inline_expansions type_id=105 bits_offset=264
	ignore_labels type_id=105 bits_offset=272
	ptr_table_stats type_id=105 bits_offset=280
	hashtable_bits type_id=69 bits_offset=288
	max_hashtable_bits type_id=69 bits_offset=296
	kabi_prefix_len type_id=71 bits_offset=304
	kabi_prefix type_id=42 bits_offset=320
	base_btf type_id=126 bits_offset=384
	conf_fprintf type_id=128 bits_offset=448
[119] FUNC_PROTO (anon) return=116 args=(120 (null), 123 (null))
[120] PTR (anon) type_id=121
[121] STRUCT cu size=312
	node type_id=110 bits_offset=0
	tags type_id=110 bits_offset=128
	tool_list type_id=110 bits_offset=256
	types_table type_id=130 bits_offset=384
	functions_table type_id=130 bits_offset=512
	tags_table type_id=130 bits_offset=640
	functions type_id=109 bits_offset=768
	name type_id=21 bits_offset=832
	filename type_id=21 bits_offset=896
	priv type_id=20 bits_offset=960
	dfops type_id=150 bits_offset=1024
	elf type_id=104 bits_offset=1088
	dwfl type_id=103 bits_offset=1152
	obstack type_id=91 bits_offset=1216
	cached_symtab_nr_entries type_id=72 bits_offset=1920
	use_obstack type_id=105 bits_offset=1952
	addr_size type_id=69 bits_offset=1960
	extra_dbg_info type_id=69 bitfield_size=1 bits_offset=1968
	has_addr_info type_id=69 bitfield_size=1 bits_offset=1969
	uses_global_strings type_id=69 bitfield_size=1 bits_offset=1970
	little_endian type_id=69 bitfield_size=1 bits_offset=1971
	language type_id=71 bitfield_size=0 bits_offset=1984
	nr_inline_expansions type_id=3 bitfield_size=0 bits_offset=2048
	size_inline_expansions type_id=1 bitfield_size=0 bits_offset=2112
	nr_functions_changed type_id=72 bitfield_size=0 bits_offset=2176
	nr_structures_changed type_id=72 bitfield_size=0 bits_offset=2208
	max_len_changed_item type_id=1 bitfield_size=0 bits_offset=2240
	function_bytes_added type_id=1 bitfield_size=0 bits_offset=2304
	function_bytes_removed type_id=1 bitfield_size=0 bits_offset=2368
	build_id_len type_id=13 bitfield_size=0 bits_offset=2432
	build_id type_id=151 bitfield_size=0 bits_offset=2464
[122] CONST (anon) type_id=121
[123] PTR (anon) type_id=118
[124] PTR (anon) type_id=119
[125] FWD btf struct
[126] PTR (anon) type_id=125
[127] STRUCT conf_fprintf size=80
	prefix type_id=42 bits_offset=0
	suffix type_id=42 bits_offset=64
	type_spacing type_id=67 bits_offset=128
	name_spacing type_id=67 bits_offset=160
	base_offset type_id=72 bits_offset=192
	count type_id=72 bits_offset=224
	cachelinep type_id=129 bits_offset=256
	seek_bytes type_id=42 bits_offset=320
	size_bytes type_id=42 bits_offset=384
	header_type type_id=42 bits_offset=448
	range type_id=42 bits_offset=512
	skip type_id=72 bits_offset=576
	indent type_id=69 bits_offset=608
	expand_types type_id=69 bitfield_size=1 bits_offset=616
	expand_pointers type_id=69 bitfield_size=1 bits_offset=617
	rel_offset type_id=69 bitfield_size=1 bits_offset=618
	emit_stats type_id=69 bitfield_size=1 bits_offset=619
	suppress_comments type_id=69 bitfield_size=1 bits_offset=620
	has_alignment_info type_id=69 bitfield_size=1 bits_offset=621
	suppress_aligned_attribute type_id=69 bitfield_size=1 bits_offset=622
	suppress_offset_comment type_id=69 bitfield_size=1 bits_offset=623
	suppress_force_paddings type_id=69 bitfield_size=1 bits_offset=624
	suppress_packed type_id=69 bitfield_size=1 bits_offset=625
	show_decl_info type_id=69 bitfield_size=1 bits_offset=626
	show_only_data_members type_id=69 bitfield_size=1 bits_offset=627
	no_semicolon type_id=69 bitfield_size=1 bits_offset=628
	show_first_biggest_size_base_type_member type_id=69 bitfield_size=1 bits_offset=629
	flat_arrays type_id=69 bitfield_size=1 bits_offset=630
	first_member type_id=69 bitfield_size=1 bits_offset=631
	last_member type_id=69 bitfield_size=1 bits_offset=632
	union_member type_id=69 bitfield_size=1 bits_offset=633
	no_parm_names type_id=69 bitfield_size=1 bits_offset=634
	classes_as_structs type_id=69 bitfield_size=1 bits_offset=635
	hex_fmt type_id=69 bitfield_size=1 bits_offset=636
	strip_inline type_id=69 bitfield_size=1 bits_offset=637
[128] PTR (anon) type_id=127
[129] PTR (anon) type_id=72
[130] STRUCT ptr_table size=16
	entries type_id=62 bits_offset=0
	nr_entries type_id=72 bits_offset=64
	allocated_entries type_id=72 bits_offset=96
[131] STRUCT debug_fmt_ops size=72
	name type_id=42 bits_offset=0
	init type_id=133 bits_offset=64
	exit type_id=97 bits_offset=128
	load_file type_id=137 bits_offset=192
	tag__decl_file type_id=143 bits_offset=256
	tag__decl_line type_id=145 bits_offset=320
	tag__orig_id type_id=147 bits_offset=384
	cu__delete type_id=149 bits_offset=448
	has_alignment_info type_id=105 bits_offset=512
[132] FUNC_PROTO (anon) return=13 args=(void)
[133] PTR (anon) type_id=132
[134] FUNC_PROTO (anon) return=13 args=(135 (null), 123 (null), 42 (null))
[135] PTR (anon) type_id=136
[136] FWD cus struct
[137] PTR (anon) type_id=134
[138] FUNC_PROTO (anon) return=42 args=(139 (null), 142 (null))
[139] PTR (anon) type_id=141
[140] STRUCT tag size=40
	node type_id=110 bits_offset=0
	type type_id=117 bits_offset=128
	tag type_id=71 bits_offset=160
	visited type_id=105 bits_offset=176
	top_level type_id=105 bits_offset=184
	recursivity_level type_id=71 bits_offset=192
	priv type_id=20 bits_offset=256
[141] CONST (anon) type_id=140
[142] PTR (anon) type_id=122
[143] PTR (anon) type_id=138
[144] FUNC_PROTO (anon) return=72 args=(139 (null), 142 (null))
[145] PTR (anon) type_id=144
[146] FUNC_PROTO (anon) return=76 args=(139 (null), 142 (null))
[147] PTR (anon) type_id=146
[148] FUNC_PROTO (anon) return=0 args=(120 (null))
[149] PTR (anon) type_id=148
[150] PTR (anon) type_id=131
[151] ARRAY (anon) type_id=4 index_type_id=13 nr_elems=0
[152] STRUCT tag_cu size=16
	tag type_id=153 bits_offset=0
	cu type_id=120 bits_offset=64
[153] PTR (anon) type_id=140
[154] STRUCT namespace size=72
	tag type_id=140 bits_offset=0
	name type_id=42 bits_offset=320
	nr_tags type_id=71 bits_offset=384
	shared_tags type_id=69 bits_offset=400
	tags type_id=110 bits_offset=448
[155] CONST (anon) type_id=154
[156] STRUCT ip_tag size=48
	tag type_id=140 bits_offset=0
	addr type_id=74 bits_offset=320
[157] STRUCT lexblock size=80
	ip type_id=156 bits_offset=0
	tags type_id=110 bits_offset=384
	size type_id=72 bits_offset=512
	nr_inline_expansions type_id=71 bits_offset=544
	nr_labels type_id=71 bits_offset=560
	nr_variables type_id=71 bits_offset=576
	nr_lexblocks type_id=71 bits_offset=592
	size_inline_expansions type_id=72 bits_offset=608
[158] STRUCT ftype size=64
	tag type_id=140 bits_offset=0
	parms type_id=110 bits_offset=320
	nr_parms type_id=71 bits_offset=448
	unspec_parms type_id=69 bits_offset=464
[159] UNION (anon) size=16
	tool_node type_id=110 bits_offset=0
	tool_hnode type_id=113 bits_offset=0
[160] STRUCT function size=240
	proto type_id=158 bits_offset=0
	lexblock type_id=157 bits_offset=512
	rb_node type_id=106 bits_offset=1152
	name type_id=42 bits_offset=1344
	linkage_name type_id=42 bits_offset=1408
	cu_total_size_inline_expansions type_id=72 bits_offset=1472
	cu_total_nr_inline_expansions type_id=71 bits_offset=1504
	inlined type_id=69 bitfield_size=2 bits_offset=1520
	abstract_origin type_id=69 bitfield_size=1 bits_offset=1522
	external type_id=69 bitfield_size=1 bits_offset=1523
	accessibility type_id=69 bitfield_size=2 bits_offset=1524
	virtuality type_id=69 bitfield_size=2 bits_offset=1526
	declaration type_id=69 bitfield_size=1 bits_offset=1528
	btf type_id=69 bitfield_size=1 bits_offset=1529
	vtable_entry type_id=67 bitfield_size=0 bits_offset=1536
	vtable_node type_id=110 bitfield_size=0 bits_offset=1600
	(anon) type_id=159 bitfield_size=0 bits_offset=1728
	priv type_id=20 bitfield_size=0 bits_offset=1856
[161] STRUCT class_member size=96
	tag type_id=140 bits_offset=0
	name type_id=42 bits_offset=320
	bit_offset type_id=72 bits_offset=384
	bit_size type_id=72 bits_offset=416
	byte_offset type_id=72 bits_offset=448
	byte_size type_id=1 bits_offset=512
	bitfield_offset type_id=66 bits_offset=576
	bitfield_size type_id=69 bits_offset=584
	bit_hole type_id=69 bits_offset=592
	bitfield_end type_id=69 bitfield_size=1 bits_offset=600
	const_value type_id=74 bitfield_size=0 bits_offset=640
	alignment type_id=72 bitfield_size=0 bits_offset=704
	visited type_id=69 bitfield_size=1 bits_offset=736
	is_static type_id=69 bitfield_size=1 bits_offset=737
	has_bit_offset type_id=69 bitfield_size=1 bits_offset=738
	accessibility type_id=69 bitfield_size=2 bits_offset=739
	virtuality type_id=69 bitfield_size=2 bits_offset=741
	hole type_id=71 bitfield_size=0 bits_offset=752
[162] CONST (anon) type_id=161
[163] STRUCT tag_cu_node size=32
	node type_id=110 bits_offset=0
	tc type_id=152 bits_offset=128
[164] STRUCT type size=168
	namespace type_id=154 bits_offset=0
	node type_id=110 bits_offset=576
	size type_id=72 bits_offset=704
	size_diff type_id=67 bits_offset=736
	nr_static_members type_id=71 bits_offset=768
	nr_members type_id=71 bits_offset=784
	alignment type_id=72 bits_offset=800
	sizeof_member type_id=166 bits_offset=832
	type_member type_id=166 bits_offset=896
	filter type_id=168 bits_offset=960
	type_enum type_id=110 bits_offset=1024
	member_prefix type_id=21 bits_offset=1152
	member_prefix_len type_id=71 bits_offset=1216
	max_tag_name_len type_id=71 bits_offset=1232
	natural_alignment type_id=71 bits_offset=1248
	packed_attributes_inferred type_id=105 bits_offset=1264
	declaration type_id=69 bits_offset=1272
	definition_emitted type_id=69 bitfield_size=1 bits_offset=1280
	fwd_decl_emitted type_id=69 bitfield_size=1 bits_offset=1281
	resized type_id=69 bitfield_size=1 bits_offset=1282
[165] CONST (anon) type_id=164
[166] PTR (anon) type_id=161
[167] STRUCT class_member_filter size=16
	left type_id=166 bits_offset=0
	right type_id=74 bits_offset=64
[168] PTR (anon) type_id=167
[169] STRUCT class size=208
	type type_id=164 bits_offset=0
	vtable type_id=110 bits_offset=1344
	nr_vtable_entries type_id=71 bits_offset=1472
	nr_holes type_id=69 bits_offset=1488
	nr_bit_holes type_id=69 bits_offset=1496
	pre_hole type_id=71 bits_offset=1504
	padding type_id=71 bits_offset=1520
	pre_bit_hole type_id=69 bits_offset=1536
	bit_padding type_id=69 bits_offset=1544
	holes_searched type_id=105 bits_offset=1552
	is_packed type_id=105 bits_offset=1560
	priv type_id=20 bits_offset=1600
[170] CONST (anon) type_id=169
[171] STRUCT base_type size=56
	tag type_id=140 bits_offset=0
	name type_id=42 bits_offset=320
	bit_size type_id=71 bits_offset=384
	name_has_encoding type_id=69 bitfield_size=1 bits_offset=400
	is_signed type_id=69 bitfield_size=1 bits_offset=401
	is_bool type_id=69 bitfield_size=1 bits_offset=402
	is_varargs type_id=69 bitfield_size=1 bits_offset=403
	float_type type_id=69 bitfield_size=4 bits_offset=404
[172] STRUCT array_type size=56
	tag type_id=140 bits_offset=0
	nr_entries type_id=129 bits_offset=320
	dimensions type_id=69 bits_offset=384
	is_vector type_id=105 bits_offset=392
[173] STRUCT enumerator size=72
	tag type_id=140 bits_offset=0
	name type_id=42 bits_offset=320
	value type_id=72 bits_offset=384
	type_enum type_id=152 bits_offset=448
[174] CONST (anon) type_id=173
[175] ARRAY (anon) type_id=23 index_type_id=13 nr_elems=0
[176] CONST (anon) type_id=175
[177] STRUCT structure size=72
	node type_id=110 bits_offset=0
	rb_node type_id=106 bits_offset=128
	class type_id=178 bits_offset=320
	cu type_id=120 bits_offset=384
	id type_id=72 bits_offset=448
	nr_files type_id=72 bits_offset=480
	nr_methods type_id=72 bits_offset=512
[178] PTR (anon) type_id=169
[179] FUNC_PROTO (anon) return=0 args=(180 (null))
[180] PTR (anon) type_id=177
[181] PTR (anon) type_id=179
[182] FUNC_PROTO (anon) return=0 args=(178 (null), 120 (null), 72 (null))
[183] PTR (anon) type_id=182
[184] ARRAY (anon) type_id=22 index_type_id=13 nr_elems=128
[185] FUNC_PROTO (anon) return=0 args=(39 (null), 49 (null))
[186] PTR (anon) type_id=185
[187] CONST (anon) type_id=186
[188] ARRAY (anon) type_id=45 index_type_id=13 nr_elems=69
[189] CONST (anon) type_id=188
[190] ARRAY (anon) type_id=23 index_type_id=13 nr_elems=5
[191] CONST (anon) type_id=190
[192] STRUCT type_instance size=24
	type type_id=193 bits_offset=0
	cu type_id=120 bits_offset=64
	read_already type_id=105 bits_offset=128
	instance type_id=194 bits_offset=136
[193] PTR (anon) type_id=164
[194] ARRAY (anon) type_id=22 index_type_id=13 nr_elems=0
[195] STRUCT prototype size=80
	node type_id=110 bits_offset=0
	class type_id=153 bits_offset=128
	cu type_id=120 bits_offset=192
	type type_id=42 bits_offset=256
	type_enum type_id=42 bits_offset=320
	size type_id=42 bits_offset=384
	range type_id=42 bits_offset=448
	filter type_id=21 bits_offset=512
	nr_args type_id=71 bits_offset=576
	type_enum_resolved type_id=105 bits_offset=592
	name type_id=196 bits_offset=600
[196] ARRAY (anon) type_id=22 index_type_id=13 nr_elems=0
[197] PTR (anon) type_id=192
[198] PTR (anon) type_id=195
[199] PTR (anon) type_id=111
[200] ARRAY (anon) type_id=22 index_type_id=13 nr_elems=1024
[201] PTR (anon) type_id=163
[202] PTR (anon) type_id=120
[203] PTR (anon) type_id=173
[204] ARRAY (anon) type_id=22 index_type_id=13 nr_elems=4096
[205] PTR (anon) type_id=172
[206] PTR (anon) type_id=69
[207] ARRAY (anon) type_id=23 index_type_id=13 nr_elems=30
[208] CONST (anon) type_id=207
[209] PTR (anon) type_id=160
[210] PTR (anon) type_id=171
[211] ARRAY (anon) type_id=22 index_type_id=13 nr_elems=64
[212] ARRAY (anon) type_id=23 index_type_id=13 nr_elems=21
[213] CONST (anon) type_id=212
[214] ARRAY (anon) type_id=23 index_type_id=13 nr_elems=17
[215] CONST (anon) type_id=214
[216] PTR (anon) type_id=109
[217] PTR (anon) type_id=108
[218] PTR (anon) type_id=107
[219] PTR (anon) type_id=105
[220] PTR (anon) type_id=174
[221] PTR (anon) type_id=170
[222] PTR (anon) type_id=165
[223] PTR (anon) type_id=155
[224] PTR (anon) type_id=162
[225] PTR (anon) type_id=158
[226] PTR (anon) type_id=154
[227] FUNC_PROTO (anon) return=13 args=(13 argc, 61 argv)
[228] FUNC main type_id=227
[229] FUNC_PROTO (anon) return=13 args=(void)
[230] FUNC populate_class_names type_id=229
[231] FUNC_PROTO (anon) return=13 args=(42 s)
[232] FUNC add_class_name_entry type_id=231
[233] FUNC_PROTO (anon) return=13 args=(112 prototypes, 42 filename)
[234] FUNC prototypes__load type_id=233
[235] FUNC_PROTO (anon) return=13 args=(112 prototypes, 42 entry)
[236] FUNC prototypes__add type_id=235
[237] FUNC_PROTO (anon) return=116 args=(120 cu, 123 conf_load)
[238] FUNC pahole_stealer type_id=237
[239] FUNC_PROTO (anon) return=13 args=(193 type, 120 cu, 42 type_enum)
[240] FUNC type__find_type_enum type_id=239
[241] FUNC_PROTO (anon) return=13 args=(193 type, 153 type_enum, 120 cu)
[242] FUNC type__add_type_enum type_id=241
[243] FUNC_PROTO (anon) return=201 args=(153 tag, 120 cu)
[244] FUNC tag_cu_node__new type_id=243
[245] FUNC_PROTO (anon) return=198 args=(42 expression)
[246] FUNC prototype__new type_id=245
[247] FUNC_PROTO (anon) return=168 args=(193 type, 21 sfilter)
[248] FUNC class_member_filter__new type_id=247
[249] FUNC_PROTO (anon) return=13 args=(168 filter, 193 type, 21 sfilter)
[250] FUNC class_member_filter__parse type_id=249
[251] FUNC_PROTO (anon) return=13 args=(198 prototype, 197 header, 39 input, 39 output)
[252] FUNC prototype__stdio_fprintf_value type_id=251
[253] FUNC_PROTO (anon) return=68 args=(197 instance, 39 fp)
[254] FUNC type__instance_read_once type_id=253
[255] FUNC_PROTO (anon) return=68 args=(197 instance, 42 member_name_orig)
[256] FUNC type_instance__int_value type_id=255
[257] FUNC_PROTO (anon) return=0 args=(197 instance)
[258] FUNC type_instance__delete type_id=257
[259] FUNC_PROTO (anon) return=197 args=(193 type, 120 cu)
[260] FUNC type_instance__new type_id=259
[261] FUNC_PROTO (anon) return=153 args=(153 tag, 202 cup, 20 instance)
[262] FUNC tag__real_type type_id=261
[263] FUNC_PROTO (anon) return=105 args=(153 tag, 20 instance)
[264] FUNC type__filter_value type_id=263
[265] FUNC_PROTO (anon) return=74 args=(153 tag, 13 _sizeof, 20 instance)
[266] FUNC tag__real_sizeof type_id=265
[267] FUNC_PROTO (anon) return=13 args=(39 fp, 38 offset)
[268] FUNC pipe_seek type_id=267
[269] FUNC_PROTO (anon) return=13 args=(153 type, 120 cu, 20 instance, 13 _sizeof, 39 fp)
[270] FUNC tag__fprintf_value type_id=269
[271] FUNC_PROTO (anon) return=13 args=(153 tag, 120 cu, 20 instance, 13 _sizeof, 13 indent, 39 fp)
[272] FUNC class__fprintf_value type_id=271
[273] FUNC_PROTO (anon) return=13 args=(153 tag, 120 cu, 20 instance, 13 _sizeof, 13 indent, 105 brackets, 39 fp)
[274] FUNC __class__fprintf_value type_id=273
[275] FUNC_PROTO (anon) return=13 args=(153 tag, 120 cu, 20 instance, 13 _sizeof, 39 fp)
[276] FUNC array__fprintf_value type_id=275
